[
  {
    "name": "Parrillada",
    "description": "For seafood lovers an exquisite dish: grilled lobster, shrimp, scallops, tuna and crab topped with melted cheese. garnished with lettuce, tomatoes, cucumbers, jalapenos and melted butter on the side. served with spanish rice",
    "price": "31.45"
  },
  {
    "name": "Lomo De Puerco En Mole De Almendras",
    "description": "Almonds, chile guajillo, chile guero, yellow zucchini, milk, peanut butter and onions, served with a roasted pork loin stuffed with dried fruit, sun-dried tomatoes, swiss chard and pine nuts",
    "price": "16.75"
  },
  {
    "name": "Puntas De Filete a La Nortena",
    "description": "Top sirloin tips sauteed with bacon, jalapenos strips, onions and fresh tomatoes, served atop the almond mole. refried beans and tortillas complete this much loved dish",
    "price": "15.85"
  },
  {
    "name": "Shrimp Sonora",
    "description": "Seven large tiger prawns sauteed in garlic and butter with lemon and a hint of pepper. served with mexican white rice, black beans, & tortillas",
    "price": "15.75"
  },
  {
    "name": "Red Pipian",
    "description": "A pumpkin seed sauce made with dried chile guajillo, peanuts, pepitas, onions, tomatoes, tossed with chicken",
    "price": "15.70"
  },
  {
    "name": "Mole Negro",
    "description": "The king of moles. dried chile mulato, negro pasilla, mexican chocolate, raisins, peanuts, walnuts & bananas-tossed with chicken or turkey",
    "price": "15.70"
  },
  {
    "name": "Mole Verde",
    "description": "Fresh chile poblano, chile guero and jalapeno, blended with pepitas, sesame seeds, basil, onions, zucchini, avocados-tossed with turkey or chicken",
    "price": "15.70"
  },
  {
    "name": "Mole Poblano",
    "description": "Puebla's beloved mole. guajillo ancho dried chiles, peanuts, sesame seeds, walnuts, raisins, bananas and mexican chocolate-tossed with turkey",
    "price": "15.70"
  },
  {
    "name": "Mole Coloradito",
    "description": "Pine nuts, almonds, peanuts, dried chile chiuacle and guajillo chiles, blended with fresh chile poblano and mexican chocolate-served over grilled pork loin",
    "price": "15.70"
  },
  {
    "name": "Mole Amarillo",
    "description": "Golden raisins, yellow tomatoes, yellow zucchini, chile guajillo and dried seasonal yellow chiles, makes this mole a fiery favorite-tossed with chicken",
    "price": "15.70"
  },
  {
    "name": "Ramon's Famous Fish Tacos",
    "description": "Fresh grilled tuna served in soft corn tortillas garnished with fresh seasoned cabbage, cucumber salsa & limes, served with spanish rice",
    "price": "14.30"
  },
  {
    "name": "Carne Asada a La Tampiquena",
    "description": "A traditional dish from the port of tampico. a 10 oz. new york steak, cheese enchilada, refried beans, garnished with guacamole",
    "price": "14.30"
  },
  {
    "name": "Red Iguana",
    "description": "One-cheese enchilada, a taco a la iguana, a beef flauta topped with guacamole and sour cream, a chile relleno and a beef tostada complete our special combo plate",
    "price": "14.20"
  },
  {
    "name": "Pollo a La Moreliana",
    "description": "Skinless / boneless chicken marinated in white wine and spices, lightly browned then simmered with tomatoes, onions, chiles serranos, chile guero, potatoes, carrots and zucchini. served with our rice of the day and tortillas",
    "price": "14.05"
  },
  {
    "name": "Steak a La Ranchera",
    "description": "Tender cubes of new york steak, grilled and cooked with our special sauce of green chiles, fresh tomatoes and potatoes. served with rice and beans",
    "price": "13.90"
  },
  {
    "name": "Pescado a La Veracruzana",
    "description": "Fresh fish of the day dusted with flour, paprika and sesame seeds, pan fried and then simmered in a flavorful tomato sauce with jalapeno strips, garlic, onions, oregano, capers and green olives. served with grilled pineapple and rice of the day",
    "price": "13.85"
  },
  {
    "name": "Encebollado",
    "description": "A 10 oz. new york steak, grilled and topped with sauteed onions, tossed with chorizo. served with rice and beans",
    "price": "13.60"
  },
  {
    "name": "Cochinita Pibil",
    "description": "Pork loin rubbed with achiote, vinegar, lime juice, orange juice, paprika and salt, slow roasted, then shredded and simmered in the roasting juice. served with black beans, rice of the day and tortillas",
    "price": "13.50"
  },
  {
    "name": "Iguana Plate",
    "description": "One chicken, beef or cheese enchilada, chile relleno, hard-shell beef taco with rice and beans",
    "price": "13.30"
  },
  {
    "name": "Mexican Plate",
    "description": "One chile verde burrito, hard-shell beef taco, beef tostada with rice and beans",
    "price": "13.30"
  },
  {
    "name": "Carnitas",
    "description": "Tender pieces of succulent pork cooked in its own juices, with spice and orange pulp, then fried with beer and a hint of milk",
    "price": "13.25"
  },
  {
    "name": "Tapatio Plate",
    "description": "One chicken, beef or cheese enchilada, chile relleno and beef or chicken flauta topped with sour cream and guacamole",
    "price": "12.45"
  },
  {
    "name": "Fajitas",
    "description": "Your choice of grilled top sirloin, chicken or shrimp served sizzling on a platter with onions and peppers. pico de gallo, guacamole and a jalapeno finish this popular dish. topped with hot flour tortillas",
    "price": "12.45"
  },
  {
    "name": "Poblano Plate",
    "description": "One sour cream chicken enchilada, taco a la iguana, beef tostada and a side of guacamole",
    "price": "12.45"
  },
  {
    "name": "Chile Colorado",
    "description": "Diced top sirloin seasoned and simmered in a dried new mexico chile and tomato puree sauce",
    "price": "11.50"
  },
  {
    "name": "Chile Verde",
    "description": "Tender select cubed pork cooked in our green chile and tomatillo sauce. served with rice, refried beans and tortillas",
    "price": "11.50"
  },
  {
    "name": "Chile Rellenos",
    "description": "Two anaheim peppers stuffed with jack cheese, fried in egg batter and topped with our salsa espanola. served with rice, refried beans and tortillas",
    "price": "11.15"
  },
  {
    "name": "Gringas (2)",
    "description": "Tender tips of carne adobada grilled with pineapple, sliced green, red and yellow bell peppers, tomatoes and onions, folded in a warm flour tortilla",
    "price": "11.15"
  },
  {
    "name": "Enchiladas a La Lago Salado",
    "description": "In honor of salt lake city! two corn tortillas filled with potatoes and chorizo topped with our traditional enchilada sauce, melted jack cheese, sour cream and accompanied by a chicken salad a la mexicana lettuce wrap",
    "price": "10.45"
  },
  {
    "name": "Ramon's Quesadilla San Francisco",
    "description": "A grilled flour tortilla filled with carne asada, jack cheese, sliced black olives, pico de gallo, jalapeno, avocado slices and sour cream. accompanied by a fresh cabbage salad",
    "price": "10.45"
  },
  {
    "name": "Tacos De Machaca Con Huevo",
    "description": "Three soft corn tacos filled with seasoned shredded beef, bell peppers and egg. served with guacamole. pico de gallo and refried beans",
    "price": "10.15"
  },
  {
    "name": "Tacos De Carne Asada",
    "description": "Three soft corn tacos filled with grilled top sirloin tips. served with pico de gallo, a tangy tomato salsa and refried beans",
    "price": "10.15"
  },
  {
    "name": "Two Burritos Ahogados",
    "description": "Your choice of shredded beef or chile verde burritos smothered in chile colorado sauce and melted cheese",
    "price": "9.90"
  },
  {
    "name": "Tacos Don Ramon",
    "description": "Three crisp corn tacos filled with tender top sirloin tips, grilled with pork chorizo, garnished with shredded lettuce and queso cotija, served with pico de gallo and a salsa de aguacate",
    "price": "9.90"
  },
  {
    "name": "Two Carne Asada Burritos",
    "description": "Grilled top sirloin tips with refried beans, rice and pico de gallo",
    "price": "9.90"
  },
  {
    "name": "Monterrey Plate",
    "description": "Machaca con huevo (shredded beef scrambled with eggs seasoned with bell peppers) , served with double refried pinto beans sprinkled with a blend of queso cotija and queso fresco. served with tortillas",
    "price": "9.80"
  },
  {
    "name": "Tacos De Pollo",
    "description": "Three crisp corn tacos with seasoned chicken, cooked with onions, tomato sauce garnished with melted jack cheese, served with guacamole and refried beans",
    "price": "9.65"
  },
  {
    "name": "Tacos a La Iguana",
    "description": "Three crisp corn tacos with shredded beef, melted jack cheese and sour cream, served with guacamole and refried beans",
    "price": "9.65"
  },
  {
    "name": "Sunrise Burritos",
    "description": "Two chile verde pork burritos smothered in chile verde, then topped with melted cheese and two fried eggs",
    "price": "9.60"
  },
  {
    "name": "Killer Nachos",
    "description": "A generous portion of tortilla chips topped with refried beans, chile verde, home-made chorizo, melted jack cheese, pico de gallo, guacamole, sour cream, black olives, green onions and jalapenos",
    "price": "9.50"
  },
  {
    "name": "Fresh Guacamole with Chips",
    "description": "Avocado blended with tomato, onion, serranos and cilantro",
    "price": "9.40"
  },
  {
    "name": "Enchiladas Suizas (2)",
    "description": "Avocado slices and sour cream chicken topped with mole poblano and melted jack cheese. one of our more popular dishes",
    "price": "9.40"
  },
  {
    "name": "Enchiladas Verdes",
    "description": "Two sour cream chicken enchiladas topped with mole verde and melted jack cheese. garnished with green onions, diced tomatoes and black olives",
    "price": "9.40"
  },
  {
    "name": "Enchiladas Amarillas",
    "description": "Two enchiladas stuffed with pork carnitas topped with mole amarillo, melted jack cheese and drizzled with crema mexicana",
    "price": "9.40"
  },
  {
    "name": "Enmoladas",
    "description": "Three corn tortillas folded into triangles and filled with refried beans, topped with mole negro, sprinkled with a blend of queso fresco and cotija then topped with pickled red onions",
    "price": "9.30"
  },
  {
    "name": "Papadzules",
    "description": "Two corn tortillas filled with sliced boiled egg and pipian, topped with mole verde, a bit of salsa espanola, finished with melted jack cheese and garnished with sliced pickled red onions",
    "price": "9.30"
  },
  {
    "name": "Enchiladas Potosinas (4)",
    "description": "An empanada-style enchilada made of corn masa, filled with queso fresco, green onions and crushed red chile, grilled, fried, topped with melted jack cheese and sprinkled with green onions",
    "price": "9.15"
  },
  {
    "name": "Flautas (2)",
    "description": "A blend of corn and flour tortillas filled with chicken or shredded beef, rolled and deep fried, topped with guacamole and sour cream. served with rice and refried beans",
    "price": "9.10"
  },
  {
    "name": "Guacamole Tostadas",
    "description": "A touch of refried beans with our fresh guacamole on two crisp corn tortillas, garnished with lettuce, sauce, cheese, tomatoes, sour cream and black olives",
    "price": "8.95"
  },
  {
    "name": "Enchiladas Rancheras",
    "description": "Jack cheese wrapped in two corn tortillas topped with a mountain of sauteed mushrooms, salsa ranchera and more melted jack cheese",
    "price": "8.75"
  },
  {
    "name": "Shredded Beef Burritos",
    "description": "Our seasoned shredded beef with a touch of refried beans rolled in a flour tortilla, topped with salsa espanola",
    "price": "8.75"
  },
  {
    "name": "Chile Colorado Burritos (2)",
    "description": "Refried beans with our home-made chile colorado wrapped in a flour tortilla, topped with a little a more chile colorado",
    "price": "8.75"
  },
  {
    "name": "Chile Verde Burritos (2)",
    "description": "Refried beans and our home-made pork chile verde wrapped in a flour tortilla, topped with a little more chile verde",
    "price": "8.75"
  },
  {
    "name": "Enchiladas Poblanas",
    "description": "Two sour cream cheese enchiladas topped with our traditional enchilada sauce, melted jack cheese, avocado slices and a dollop of sour cream",
    "price": "8.75"
  },
  {
    "name": "Entomatadas",
    "description": "Two sour cream chicken enchiladas topped with salsa espanola, melted jack cheese and jalapenos",
    "price": "8.75"
  },
  {
    "name": "Encurtidos",
    "description": "Four pickled jalapenos filled with shrimp and queso fresco, dipped in egg batter, fried and topped with salsa espanola, served with guacamole",
    "price": "8.75"
  },
  {
    "name": "Machaca Chimichanga (1)",
    "description": "Shredded beef with egg encased in a flour tortilla, deep fried, topped with salsa espanola, melted jack cheese, sour cream and guacamole",
    "price": "8.65"
  },
  {
    "name": "Chilaquiles",
    "description": "Tortilla chips fried with home-made chorizo, egg, salsa espanola and mole poblano. sprinkled with queso cotija and queso fresco and green onions garnished with crema mexicana and 2 avocado slices. served with refried beans",
    "price": "8.65"
  },
  {
    "name": "Chimichanga Original",
    "description": "Your choice of chile verde, chicken or shredded beef, wrapped in a flour tortilla, deep-fried, topped with salsa espanola, melted jack cheese, sour cream and guacamole",
    "price": "8.65"
  },
  {
    "name": "Huevos Con Chorizo",
    "description": "Home-made pork chorizo scrambled with eggs. served with rice, refried beans and tortillas",
    "price": "8.50"
  },
  {
    "name": "Bay Shrimp Quesadilla",
    "description": "Grilled bay shrimp seasoned with lemon, pepper and melted jack cheese, garnished with sour cream",
    "price": "8.45"
  },
  {
    "name": "Vegetarian Chimichanga (1)",
    "description": "A flour tortilla filled with sauteed vegetables, deep-fried, topped with salsa espanola, melted jack cheese, sour cream and guacamole",
    "price": "8.45"
  },
  {
    "name": "Huevos Rancheros",
    "description": "A mexican favorite! two eggs topped with salsa ranchera and jack cheese. served with rice, refried beans and tortillas",
    "price": "8.35"
  },
  {
    "name": "Cheese and Chicken",
    "description": false,
    "price": "8.35"
  },
  {
    "name": "Machaca Burritos (2)",
    "description": "Refried beans with seasoned shredded beef, bell pepper and egg rolled in a flour tortilla",
    "price": "8.20"
  },
  {
    "name": "Vegetarian Killer Nachos",
    "description": "Same delicious ingredients refried beans, chile verde, home-made chorizo, melted jack cheese, pico de gallo, guacamole, sour cream, black olives, green onions and jalapenos without the meat",
    "price": "8.15"
  },
  {
    "name": "Red Iguana Traditional Tacos",
    "description": "Two hard-shell corn tacos with shredded beef, chicken or guacamole garnished with lettuce, sauce, cheese and tomatoes",
    "price": "8.15"
  },
  {
    "name": "Red Iguana Traditional Enchiladas (2)",
    "description": "Shredded beef, chicken or cheese enchiladas in corn tortillas, topped with our home-made enchilada sauce of new mexico dried chile and melted jack cheese",
    "price": "8.15"
  },
  {
    "name": "Rajas De Chile Poblano Con Queso",
    "description": "Roasted poblano chile strips with sauteed sliced tomatoes and onions, melted jack cheese, served with your choice of tortillas",
    "price": "8.05"
  },
  {
    "name": "Tostadas De Machaca",
    "description": "Two crisp corn tortillas topped with refried beans, shredded beef with egg, adorned with lettuce, sauce, cheese, sour cream and black olives",
    "price": "7.85"
  },
  {
    "name": "Traditional Tostadas",
    "description": "Two crisp corn tortillas topped with refried beans, your choice of shredded beef or chicken, lettuce, sauce, cheese, tomatoes, sour cream and black olives",
    "price": "7.80"
  },
  {
    "name": "Cheese and Rajas De Chile Poblano, Onion and Tomatoes",
    "description": false,
    "price": "7.45"
  },
  {
    "name": "Cheese and Sauteed Mushrooms",
    "description": false,
    "price": "7.45"
  },
  {
    "name": "Cheese, Potatoes and Chorizo",
    "description": false,
    "price": "7.45"
  },
  {
    "name": "Chicken Salad a La Mexicana",
    "description": "Chopped chicken breast blended with chipotle chiles, pecans, mayonnaise and a hint of mustard. served in a lettuce bowl with avocado slices",
    "price": "7.40"
  },
  {
    "name": "Two Bean Cheese Burritos",
    "description": false,
    "price": "6.90"
  },
  {
    "name": "Chile Colorado",
    "description": false,
    "price": "6.65"
  },
  {
    "name": "Chile Verde",
    "description": false,
    "price": "6.65"
  },
  {
    "name": "Melted Jack Cheese",
    "description": false,
    "price": "6.60"
  },
  {
    "name": "Hongos Al Ajillo",
    "description": "Mushrooms sautéed with garlic, butter, white wine and crushed red chile",
    "price": "6.55"
  },
  {
    "name": "Chile Con Queso",
    "description": "Anaheim chile, fresh jalapenos, onions and tomato cooked with two types of cheese",
    "price": "6.50"
  },
  {
    "name": "Nachos Regulares",
    "description": "Home-made tortilla chips topped with refried beans and melted cheese, garnished with jalapenos, sour cream, olives and tomatoes",
    "price": "5.95"
  },
  {
    "name": "Fried Ice Cream",
    "description": "A flour tortilla filled with vanilla ice cream, shredded coconut, cinnamon and sugar; fried to a golden brown",
    "price": "5.50"
  },
  {
    "name": "Homemade Sopapillas",
    "description": "Golden fried fritters topped with cinnamon, sugar and honey",
    "price": "5.25"
  },
  {
    "name": "Home Made Flan",
    "description": "Mexican caramel custard",
    "price": "5.25"
  },
  {
    "name": "Sopa De Queso, Maria's Favorite Soup",
    "description": "Anaheim chiles, diced potatoes, tomatoes, onions and garlic simmered in a light broth garnished with jack cheese and crema mexicana",
    "price": "5.25"
  },
  {
    "name": "Sopa De Frijol Negro",
    "description": "A puree of black bean soup with a hint of crema mexicana and crisp tortilla garnish",
    "price": "5.25"
  },
  {
    "name": "Red Iguana Dinner Salad",
    "description": "Romaine lettuce with diced nopales, tomatoes and cotija cheese tossed with your choice of homemade salad dressing",
    "price": "5.25"
  },
  {
    "name": "Pan De Tres Leches",
    "description": "A moist vanilla and milk cake",
    "price": "4.50"
  },
  {
    "name": "Xango Cheese Cake",
    "description": "A fried cream cheese pastry",
    "price": "4.00"
  },
  {
    "name": "Ice Cream Or Sherbet",
    "description": false,
    "price": "4.00"
  },
  {
    "name": "Fresh Peach, Strawberry, Or Mango Virgin Margaritas",
    "description": false,
    "price": "3.95"
  },
  {
    "name": "Soothing Pina Colada",
    "description": false,
    "price": "3.95"
  },
  {
    "name": "Side of French Fries",
    "description": false,
    "price": "3.85"
  },
  {
    "name": "Fresh Squeezed Orange Juice",
    "description": false,
    "price": "3.45"
  },
  {
    "name": "Guacamole",
    "description": false,
    "price": "3.40"
  },
  {
    "name": "One Beef, Chicken Or Bean Taco",
    "description": false,
    "price": "3.25"
  },
  {
    "name": "One Bean & Cheese Burrito",
    "description": false,
    "price": "3.25"
  },
  {
    "name": "Cheese Quesadilla",
    "description": false,
    "price": "3.25"
  },
  {
    "name": "2 Flautas",
    "description": false,
    "price": "3.25"
  },
  {
    "name": "A Dish of Rice & Beans",
    "description": false,
    "price": "3.10"
  },
  {
    "name": "Arroz Con Leche",
    "description": "Homemade mexican style rice pudding",
    "price": "3.00"
  },
  {
    "name": "Tomato Juice",
    "description": false,
    "price": "3.00"
  },
  {
    "name": "Mole",
    "description": false,
    "price": "2.70"
  },
  {
    "name": "Hecho En Mexico",
    "description": "A carbonated natural flavored drink",
    "price": "2.10"
  },
  {
    "name": "Diet Coke",
    "description": "With refill",
    "price": "2.10"
  },
  {
    "name": "Coke",
    "description": "With refill",
    "price": "2.10"
  },
  {
    "name": "Milk",
    "description": "With refill",
    "price": "2.10"
  },
  {
    "name": "Ice Tea",
    "description": "With refill",
    "price": "2.10"
  },
  {
    "name": "Hot Chocolate",
    "description": "With refill",
    "price": "2.10"
  },
  {
    "name": "Hot Tea",
    "description": "With refill",
    "price": "2.10"
  },
  {
    "name": "Coffee",
    "description": "With refill",
    "price": "2.10"
  },
  {
    "name": "Sparkling Mineral Water Or Bottled Water",
    "description": false,
    "price": "2.10"
  },
  {
    "name": "Agua De Horchata",
    "description": "With refill",
    "price": "2.10"
  },
  {
    "name": "Jarritos",
    "description": false,
    "price": "2.10"
  },
  {
    "name": "Lemonade",
    "description": "With refill",
    "price": "2.10"
  },
  {
    "name": "Sangria Senorial",
    "description": false,
    "price": "2.10"
  },
  {
    "name": "Limon",
    "description": false,
    "price": "2.10"
  },
  {
    "name": "Jamaica Guava",
    "description": false,
    "price": "2.10"
  },
  {
    "name": "Mineral & Apple Sidral",
    "description": false,
    "price": "2.10"
  },
  {
    "name": "Dr. Pepper",
    "description": "With refill",
    "price": "2.10"
  },
  {
    "name": "Sprite",
    "description": "With refill",
    "price": "2.10"
  },
  {
    "name": "Side of Fried Plantain",
    "description": false,
    "price": "1.75"
  },
  {
    "name": "Spanish Rice",
    "description": false,
    "price": "1.70"
  },
  {
    "name": "Refried Beans",
    "description": false,
    "price": "1.70"
  },
  {
    "name": "Black Beans",
    "description": false,
    "price": "1.70"
  },
  {
    "name": "Sour Cream",
    "description": false,
    "price": "1.00"
  },
  {
    "name": "Pico De Gallo",
    "description": false,
    "price": "0.90"
  },
  {
    "name": "Flour Tortillas (2)",
    "description": false,
    "price": "0.85"
  },
  {
    "name": "Corn Tortillas (3)",
    "description": false,
    "price": "0.80"
  }
]
